package ru.taptap.journeyalarmclock.ui;

public class разбитие {

}

//1) показывается карта с полями вверху "откуда" и "куда"
//2) пользователь либо вводит в поля, и по ним определяется место, либо выбирает их на карте
//3) Тут надо запросить пермишн. После этого пользователь переходит в режим выбора радиуса будильника
//        (нажимает на точку, а потом отводит палец в сторону)
//4) когда будильник срабатывает начинает играть мелодия (выбирается в настройках) и сверху появляется
//        нотификация "выключить", "отложить еще на 20%"
//5) карта должна уметь показывать движение по маршруту
//
//
//
//
//
//
//
//
//ui                 presenter                model
//показать карту
